import React from 'react';
import '@app/styles/test.scss';

const TermsAndConditions: React.FC = () => (
    <div className="result">
        <div className="test-result">
            <div className="test-result__inner">
                <h1 className="test-result__title">
                    Умови користування сайтом (Terms and Conditions)
                </h1>
                <div className="test-result__description">
                    <b>Останнє оновлення:</b> 20.06.2025
                    <p>Будь ласка, уважно прочитайте ці Умови користування перед використанням сайту <b>goprofi.app</b>, що належить <b>ФОП Довбня Олександр Юрійович</b> (ЄДРПОУ / РНОКПП: 3306205254).
                    </p>
                </div>
                <div className="test-result__content">
                    <h2>1. Загальні положення</h2>
                    <p>Використовуючи сайт goprofi.app, Ви погоджуєтесь з цими Умовами. Якщо Ви не згодні з умовами — будь ласка, не використовуйте сайт.</p>
                    <hr />
                    <h2>2. Реєстрація</h2>
                    <p>Для використання певних функцій платформи може знадобитися реєстрація. Ви зобов’язуєтеся надавати правдиву та актуальну інформацію.</p>
                    <hr />
                    <h2>3. Використання сервісу</h2>
                    <p>Ви погоджуєтесь не використовувати платформу для незаконної діяльності або дій, які можуть завдати шкоди іншим користувачам або сервісу.</p>
                    <hr />
                    <h2>4. Інтелектуальна власність</h2>
                    <p>Усі права на контент, тексти, графіку, логотипи та програмне забезпечення належать GoProfi або його партнерам. Заборонено копіювати, поширювати чи змінювати матеріали без письмової згоди.</p>
                    <hr />
                    <h2>5. Обмеження відповідальності</h2>
                    <p>GoProfi не несе відповідальності за будь-які прямі або непрямі збитки, що виникли внаслідок використання сайту або неможливості його використання.</p>
                    <hr />
                    <h2>6. Зміни умов</h2>
                    <p>GoProfi має право змінювати ці Умови в будь-який момент. Актуальна версія завжди публікується на сайті.</p>
                    <hr />
                    <h2>7. Контактна інформація</h2>
                    <p>ФОП Довбня Олександр Юрійович</p>
                    <p>Email: <b>info@goprofi.app</b></p>
                    <hr />
                </div>
            </div>
            <div className="test-result__inner test-result__inner-margin-top">
                <h1 className="test-result__title">
                    Політика повернення коштів (Return & Refund Policy)
                </h1>
                <div className="test-result__description">
                    <b>Останнє оновлення:</b> 20.06.2025
                    <p>Ця Політика повернення коштів є частиною Умов користування сайтом <b>goprofi.app</b>, який належить <b>ФОП Довбня Олександр Юрійович (ЄДРПОУ / РНОКПП: 3306205254).</b></p>
                </div>
                <div className="test-result__content">
                    <h2>1. Загальні положення</h2>
                    <p>Оскільки наш сервіс надає <b>нематеріальні цифрові інформаційні послуги</b> (доступ до онлайн-тестів та результатів тестування), повернення коштів можливе лише у випадках, передбачених цією політикою.</p>
                    <hr />
                    <h2>2. Умови повернення коштів</h2>
                    <ul>2.1. Повернення коштів можливе лише у випадках, якщо:
                    <li>Послуга не була надана через технічні помилки з боку сервісу;</li>
                    <li>Замовник не отримав доступ до тесту або результатів після успішної оплати;</li>
                    <li>Сталася помилкова подвійна оплата одного і того ж замовлення.</li>
                    </ul>
                    <ul>2.2. Повернення не здійснюється, якщо Замовник:
                    <li>Пройшов тест та отримав результати;</li>
                    <li>Змінив рішення щодо використання сервісу після оплати;</li>
                    <li>Очікував інші результати або інтерпретації, ніж ті, що були надані.</li>
                    </ul>
                    <p>2.3. Результати тестів мають <b>інформаційний характер</b>, не є гарантією працевлаштування, фінансових або інших досягнень, і не є підставою для повернення коштів у разі суб’єктивної незадоволеності.</p>
                    <hr />
                    <h2>3. Процедура повернення коштів</h2>
                    <ul>3.1. Для ініціювання повернення коштів необхідно надіслати запит на електронну адресу: <b>info@goprofi.app</b>, зазначивши:
                    <li>ПІБ</li>
                    <li>Email, з якого здійснено оплату</li>
                    <li>Дату оплати</li>
                    <li>Причину запиту на повернення</li>
                    <li>Підтвердження платежу (чек або скріншот)</li>
                    </ul>
                    <p>3.2. Розгляд запиту триває до <b>7 робочих днів</b> з моменту отримання повної інформації.</p>
                    <p>3.3. У разі прийняття рішення про повернення коштів, гроші повертаються на той самий платіжний метод, з якого було здійснено оплату, протягом <b>10 робочих днів.</b></p>
                    <p></p>
                    <hr />
                    <h2>4. Контакти</h2>
                    <p>ФОП Довбня Олександр Юрійович</p>
                       <p>ЄДРПОУ / РНОКПП: 3306205254</p>
                        <p>Email: <b>info@goprofi.app</b></p>
                        <p>Сайт: <b>https://goprofi.app</b></p>
                    <hr />
                </div>
            </div>
        </div>
    </div>
)

export default TermsAndConditions