import React from 'react';
import '@app/styles/test.scss';

const PrivacyPolicy: React.FC = () => (
  <div className="result">
    <div className="test-result">
      <div className="test-result__inner">
        <h1 className="test-result__title">
          Політика конфіденційності
        </h1>
        <div className="test-result__description">
          <b>Останнє оновлення:</b> 20.06.2025
          <p>
            Ця Політика конфіденційності описує, як ми, <b>ФОП Довбня Олександр Юрійович</b> (ЄДРПОУ/РНОКПП: 3306205254), збираємо, використовуємо та захищаємо Ваші персональні дані на сайті <b>goprofi.app</b>.
          </p>
        </div>
        <div className="test-result__content">
          <h2>1. Хто ми</h2>
          <p>Оператором персональних даних є:</p>
          <p><b>ФОП Довбня Олександр Юрійович</b></p>
          <p>ЄДРПОУ / РНОКПП: 3306205254</p>
          <p>Email: <b>info@goprofi.app</b></p>
          <hr />
          <h2>2. Які дані ми збираємо</h2>
          <ul>
            <li>Ім’я, прізвище</li>
            <li>Email</li>
            <li>Дані, що надаються під час реєстрації або користування платформою</li>
            <li>Дані про поведінку на сайті (cookies, IP-адреса, інформація про пристрій)</li>
          </ul>
          <hr />
          <h2>3. З якою метою ми використовуємо дані</h2>
          <ul>
            <li>Для надання доступу до сервісу GoProfi</li>
            <li>Для комунікації з користувачем</li>
            <li>Для покращення функціоналу та користувацького досвіду</li>
            <li>Для аналітики та маркетингу</li>
          </ul>
          <hr />
          <h2>4. Передача даних третім сторонам</h2>
          <p>Ми не передаємо Ваші персональні дані третім сторонам, за винятком випадків, передбачених законодавством або якщо це потрібно для надання послуг (наприклад, хостинг-провайдери, аналітичні сервіси).</p>
          <hr />
          <h2>5. Cookies</h2>
          <p>Сайт використовує файли cookie для покращення роботи сервісу. Ви можете відключити cookies у своєму браузері.</p>
          <hr />
          <h2>6. Захист персональних даних</h2>
          <p>Ми застосовуємо технічні та організаційні заходи для захисту даних від несанкціонованого доступу, втрати або зміни.</p>
          <hr />
          <h2>7. Права користувача</h2>
          <p>Ви маєте право:</p>
          <ul>
            <li>Отримати доступ до своїх персональних даних</li>
            <li>Вимагати виправлення або видалення своїх даних</li>
            <li>Обмежити обробку або відкликати згоду</li>
          </ul>
          <hr />
          <h2>8. Контакт</h2>
          <p>З будь-яких питань звертайтеся на email: <b>info@goprofi.app</b></p>
        </div>
      </div>
    </div>
  </div>
)

export default PrivacyPolicy