import '@app/styles/test.scss'
import TestStepper from './TestStepper/TestStepper'
import { useState } from 'react'

const mockDataProfessions = [
  {
    id: 1,
    title: 'Творчі професії',
    descriptions: 'Для людей що відчувають потребу створювати щось унікальне та цінують свободу самовираження.',
    professions: ['Художник', 'Письменник', 'Дизайнер (графічний, веб-дизайнер)', 'Режисер', 'Фотограф', 'Музикант', 'Архітектор', 'Кінопродюсер', 'Модельєр'],
  },
  {
    id: 2,
    title: 'Медицина та допомога людям',
    descriptions: 'Для емпатичних людей, які прагнуть допомагати іншим і відчувають покликання змінювати світ на краще. ',
    professions: ['Лікар', 'Психолог', 'Ветеринар', 'Фармацевт'],
  },
  {
    id: 3,
    title: 'Бізнес та управління',
    descriptions: 'Для амбітних людей, які люблять організовувати, планувати та керувати процесами.',
    professions: ['Підприємець', 'Логіст', 'HR-спеціаліст', 'Менеджер проєктів', 'Маркетолог', 'Бізнес-аналітик'],
  },
  {
    id: 4,
    title: 'Бізнес та управління',
    descriptions: 'Для тих, хто отримує задоволення від передачі знань і натхнення інших. ',
    professions: ['Вчитель', 'Коуч', 'Тренер з особистісного розвитку', 'Викладач у ВНЗ', 'Ментор', 'Науковець', 'Лектор', 'Наставник'],
  }
]

const Test = () => {
  const [isCompleted, setCompleted] = useState<boolean>(false)

  return (
    <>
      {!isCompleted ? (
        <TestStepper setCompleted={setCompleted} />
      ) : (
        <div className="result">
          <div className="test-result">
            <div className="test-result__inner">
              <div className="test-result__title">Вітаємо з успішним проходженням тесту 🎉</div>
              <div className="test-result__description">
              <span>Ви 7 тип еннеаграми</span>, відомий як "Ентузіаст" або "Епікуреєць", є енергійною, допитливою і оптимістичною людиною, яка прагне нових вражень і задоволень.
              </div>
              <div className="test-result__content">
                <h3>Основні риси 7-го типу:</h3>
                <h4>1. Основна мотивація:</h4>
                <p>Бажання бути щасливими, уникати болю та незадоволеності.
                Прагнення до різноманітності та нових можливостей.</p>
                <hr />
                <h4>2. Основний страх:</h4>
                <p>Боязнь обмежень, рутини чи нудьги. <br />
                Страх перед стражданням чи розчаруванням.</p>
                <hr />
                <h4>3. Ключові якості:</h4>
                <p>
                  <b>Цікавість:</b> Завжди шукають щось нове – ідеї, проекти, хобі чи пригоди. <br />
                  <b>Оптимізм:</b> Схильні дивитися світ через призму можливостей, ігноруючи труднощі. <br />
                  <b>Багатозадачність:</b> Вміють справлятися з багатьма справами одночасно, але іноді це призводить до недовершених проектів. <br />
                  <b> Креативність:</b> Багата уява та схильність знаходити незвичайні рішення.
                </p>
                <hr />
                <h4>4. Слабкості:</h4>
                <p>Складнощі з концентрацією: можуть уникати завершення розпочатого. <br />
                Уникнення неприємних емоцій: схильні придушувати чи ігнорувати складні почуття.
                Поверхневість: можуть прагнути задоволення, упускаючи глубину.ия.</p>
                <hr />
                <h4>5. Поведінка у розслабленні:</h4>
                <p>У спокійному стані виявляють риси 5-го типу: стають більш зосередженими, заглиблюються у роздуми, аналізують.</p>
                <hr />
                <h4>6. Поведінка у розслабленні:</h4>
                <p>У спокійному стані виявляють риси 5-го типу: стають більш зосередженими, заглиблюються у роздуми, аналізують.</p>
                <hr />
                <h4>7. Найкращі якості:</h4>
                <p>
                <b>Інфекція радістю та ентузіазмом:</b> надихають оточуючих своєю енергією.
                Вміння бачити можливості там, де бачать інші проблеми. <br />
                <b>Гнучкість та пристосованість:</b> здатні швидко адаптуватися до змін. <br />
                <b>Карьера и увлечения:</b> Энтузиастам подходят роли, где они могут использовать своё воображение и любопытство, например, в сфере креативных индустрий, предпринимательства, туризма, образования или социальных проектов. <br />
                <b>Взаимоотношения:</b> Они заботятся о том, чтобы отношения оставались интересными и живыми, но могут избегать глубоких обсуждений или конфликтов, чтобы сохранить "легкость" взаимодействия.
                </p>
                <hr />
                <p style={{ fontSize: '20px' }}>
                  <span>Загалом, 7-й тип</span> — це життєрадісні дослідники, які надихають оточуючих своєю любов'ю до життя, але їм важливо вчитися приймати свої емоції та завершувати розпочате.
                </p>
              </div>
            </div>
          </div>
          <div className="suitable-professions">
            <div className="suitable-professions__title">Професії, які вам підійдуть виходячи з вашого психотипу</div>
            <div className="suitable-professions__list">
              {mockDataProfessions?.map((item: any) => (
                <div key={item?.id} className="suitable-professions__item">
                  <div className="suitable-professions__item-left">
                    <div className="suitable-professions__item-title">{item?.title}</div>
                    <div className="suitable-professions__item-text">{item?.descriptions}</div>
                  </div>
                  <div className="suitable-professions__item-right">
                    <div className="suitable-professions__item-items">
                      {item?.professions?.map((profession: string) => (
                        <div key={profession} className="suitable-professions__item-profession">{profession}</div>
                      ))}
                    </div>
                  </div>
                </div>
              ))}
            </div>
          </div>
        </div>
      )}
    </>
  )
}

export default Test