import React from 'react';
import '@app/styles/test.scss';

const PublicOfferAgreement: React.FC = () => (
    <div className="result">
        <div className="test-result">
            <div className="test-result__inner">
                <h1 className="test-result__title">
                    Договір публічної оферти щодо надання інформаційних послуг
                </h1>
                <div className="test-result__description">
                    <b>Останнє оновлення:</b> 20.06.2025
                    <p>
                        Цей документ є офіційною публічною офертою <b>ФОП Довбня Олександр Юрійович (ЄДРПОУ / РНОКПП: 3306205254)</b>, далі — <b>«Виконавець»</b>, та містить всі істотні умови договору про надання інформаційних послуг через вебсайт  <b>https://goprofi.app</b>.</p>
                        <p>Кожна особа, яка прийняла цю оферту, автоматично стає Замовником та підтверджує згоду з умовами цього договору.
                    </p>
                </div>
                <div className="test-result__content">
                    <h2>1. Предмет договору</h2>
                    <p>1.1. Виконавець надає Замовнику інформаційні послуги шляхом надання доступу до онлайн-тестів, які допомагають визначити психологічний тип, нахили та потенційні напрямки професійного розвитку.</p>
                    <p>1.2. Результати тестів мають <b>виключно інформаційний характер</b> та <b>не є професійною консультацією, медичним діагнозом чи гарантією досягнення конкретних результатів.</b></p>
                    <hr />
                    <h2>2. Порядок надання послуг</h2>
                    <p>2.1. Послуги надаються в автоматичному режимі через вебінтерфейс після заповнення тесту.</p>
                    <p>2.2. Виконавець не зобов’язаний індивідуально консультувати Замовника або давати пояснення щодо результатів тесту, якщо інше не передбачено окремими платними послугами.</p>
                    <hr />
                    <h2>3. Обмеження відповідальності</h2>
                    <ul> 3.1. Виконавець не несе відповідальності за будь-які прямі або непрямі збитки, моральну шкоду чи втрати, що можуть виникнути у Замовника внаслідок:
                        <li>прийняття рішень на основі результатів тестів;</li>
                        <li>неправильного або суб’єктивного сприйняття інформації;</li>
                        <li>використання результатів у професійній чи особистій діяльності.</li>
                    </ul>
                    <p>3.2. Замовник повністю усвідомлює, що всі результати тестів мають <b>рекомендаційний характер і не можуть бути підставою для будь-яких юридичних, фінансових, професійних чи медичних дій.</b></p>
                    <hr />
                    <h2>4. Права та обов’язки сторін</h2>
                    <ul>4.1. Виконавець має право:
                    <li>
                        змінювати зміст тестів без попередження;
                    </li>
                    <li>
                        призупинити або припинити доступ до сайту з технічних причин;
                    </li>
                    <li>
                        змінювати умови цієї оферти у будь-який час.
                    </li>
                    </ul>
                    <ul>Замовник має право:
                    <li>
                        користуватись сайтом відповідно до цих умов;
                    </li>
                    <li>
                        звертатися до служби підтримки з технічних питань.
                    </li>
                    </ul>
                    <hr />
                    <h2>5. Акцепт оферти та укладення договору</h2>
                    <p>5.1. Акцептом цієї оферти вважається початок використання сайту або проходження тесту на сайті.</p>
                    <p>5.2. Договір вважається укладеним з моменту акцепту та діє до моменту припинення користування послугами.</p>
                    <hr />
                    <h2>6. Вирішення спорів</h2>
                    <p>6.1. Усі спори вирішуються шляхом переговорів. Якщо вирішити спір не вдається, він передається на розгляд до компетентного суду України відповідно до чинного законодавства.</p>
                    <hr />
                    <h2>7. Контактна інформація Виконавця</h2>
                    <p>ФОП Довбня Олександр Юрійович</p>
                    <p>ЄДРПОУ / РНОКПП: 3306205254</p>
                    <p>Email: <b>info@goprofi.app</b></p>
                    <p>Сайт: <b>https://goprofi.app</b></p>
                    <hr />
                 </div>
            </div>
        </div>
    </div>
)

export default PublicOfferAgreement